Ran Plan for project: `prod` dir: `etc/terraform/environments` workspace: `prod`

<details><summary>Show Output</summary>

```diff
Initializing modules...
Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.9.0, ~> 4.9"...
- Finding hashicorp/template versions matching "~> 2.1"...
- Finding datadog/datadog versions matching "~> 3.1"...
- Installing hashicorp/aws v4.48.0...
- Installed hashicorp/aws v4.48.0 (signed by HashiCorp)
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (signed by HashiCorp)
- Installing datadog/datadog v3.19.1...
- Installed datadog/datadog v3.19.1 (signed by a HashiCorp partner, key ID FB70BE941301C3EA)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Switched to workspace "prod".

Downloading git::git@github.com:holaluz/kraken.git for alb...
- alb in .terraform/modules/alb/aws/ec2/alb
- alb.aws_variables in .terraform/modules/alb/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for aws_variables...
- aws_variables in .terraform/modules/aws_variables/aws/variables
Downloading git::git@github.com:holaluz/kraken.git for basic_dashboard...
- basic_dashboard in .terraform/modules/basic_dashboard/datadog/dashboards
- basic_dashboard.alb_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb
- basic_dashboard.alb_monitor.alb_4XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/4XX
- basic_dashboard.alb_monitor.alb_4XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_5XX_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/5XX
- basic_dashboard.alb_monitor.alb_5XX_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_latency_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/latency
- basic_dashboard.alb_monitor.alb_latency_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.alb_monitor.alb_request_count_monitor in .terraform/modules/basic_dashboard/datadog/monitors/alb/request_count
- basic_dashboard.alb_monitor.alb_request_count_monitor.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_api.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_api.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_api.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_api.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons in .terraform/modules/basic_dashboard/datadog/monitors/ec2
- basic_dashboard.ec2_monitor_asg_crons.cpu in .terraform/modules/basic_dashboard/datadog/monitors/ec2/cpu
- basic_dashboard.ec2_monitor_asg_crons.cpu.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.ec2_monitor_asg_crons.disk in .terraform/modules/basic_dashboard/datadog/monitors/ec2/disk
- basic_dashboard.ec2_monitor_asg_crons.disk.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors in .terraform/modules/basic_dashboard/datadog/monitors/rds
- basic_dashboard.rds_monitors.cpu_usage in .terraform/modules/basic_dashboard/datadog/monitors/rds/cpu_usage
- basic_dashboard.rds_monitors.cpu_usage.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.free_space_remaining in .terraform/modules/basic_dashboard/datadog/monitors/rds/free_space_remaining
- basic_dashboard.rds_monitors.free_space_remaining.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.rds_monitors.replica_lag in .terraform/modules/basic_dashboard/datadog/monitors/rds/replica_lag
- basic_dashboard.rds_monitors.replica_lag.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
- basic_dashboard.supervisor_monitor_crons in .terraform/modules/basic_dashboard/datadog/monitors/supervisor
- basic_dashboard.supervisor_monitor_crons.this in .terraform/modules/basic_dashboard/datadog/monitors/monitor
Downloading git::git@github.com:holaluz/kraken.git for ecs_application...
- ecs_application in .terraform/modules/ecs_application/aws/ecs/ecs_cluster_single_service
- ecs_application.ecr in .terraform/modules/ecs_application/aws/ecr
- ecs_application.ecs_cluster in .terraform/modules/ecs_application/aws/ecs/ecs_cluster
- ecs_application.ecs_service in .terraform/modules/ecs_application/aws/ecs/ecs_service
- ecs_application.ecs_service.aws_variables in .terraform/modules/ecs_application/aws/variables
- ecs_application.ecs_service.cloudwatch_log_group in .terraform/modules/ecs_application/aws/cloudwatch/log_group
- ecs_application.ecs_task in .terraform/modules/ecs_application/aws/ecs/ecs_task
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets in .terraform/modules/ecs_application/aws/iam/policy_secrets
- ecs_application.ecs_task.iam_policy_to_access_needed_secrets.aws_variables in .terraform/modules/ecs_application/aws/variables


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.alb.aws_lb.alb will be created
+ resource "aws_lb" "alb" {
+       arn                        = (known after apply)
+       arn_suffix                 = (known after apply)
+       desync_mitigation_mode     = "defensive"
+       dns_name                   = (known after apply)
+       drop_invalid_header_fields = true
+       enable_deletion_protection = false
+       enable_http2               = true
+       enable_waf_fail_open       = false
+       id                         = (known after apply)
+       idle_timeout               = 60
+       internal                   = true
+       ip_address_type            = (known after apply)
+       load_balancer_type         = "application"
+       name                       = "logicalis-poc-prod-private"
+       preserve_host_header       = true
+       security_groups            = (known after apply)
+       subnets                    = [
+           "subnet-08178094b64355e92",
+           "subnet-0847317e984ba5111",
+           "subnet-0f7ee5b76673dadae",
        ]
+       tags                       = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "alb-private"
+           "WAF"         = "disassociated"
        }
+       tags_all                   = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "alb-private"
+           "WAF"         = "disassociated"
        }
+       vpc_id                     = (known after apply)
+       zone_id                    = (known after apply)

+       access_logs {
+           bucket  = "holaluz-logs"
+           enabled = true
+           prefix  = "alb/prod/internal/logicalis-poc"
        }

+       subnet_mapping {
+           allocation_id        = (known after apply)
+           ipv6_address         = (known after apply)
+           outpost_id           = (known after apply)
+           private_ipv4_address = (known after apply)
+           subnet_id            = (known after apply)
        }
    }

  # module.alb.aws_lb_listener.no_ssl_redirect_to_ssl[0] will be created
+ resource "aws_lb_listener" "no_ssl_redirect_to_ssl" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = (known after apply)

+       default_action {
+           order = (known after apply)
+           type  = "redirect"

+           redirect {
+               host        = "#{host}"
+               path        = "/#{path}"
+               port        = "443"
+               protocol    = "HTTPS"
+               query       = "#{query}"
+               status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.with_ssl[0] will be created
+ resource "aws_lb_listener" "with_ssl" {
+       arn               = (known after apply)
+       certificate_arn   = "arn:aws:acm:eu-west-1:165908609791:certificate/96c01b14-4310-4beb-8e76-30a1208a966c"
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 443
+       protocol          = "HTTPS"
+       ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"
+       tags_all          = (known after apply)

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.alb will be created
+ resource "aws_lb_target_group" "alb" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = false
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       name                               = "logicalis-poc-prod-private"
+       port                               = 8080
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "alb-private"
+           "WAF"         = "disassociated"
        }
+       tags_all                           = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "alb-private"
+           "WAF"         = "disassociated"
        }
+       target_type                        = "ip"
+       vpc_id                             = "vpc-f504e990"

+       health_check {
+           enabled             = true
+           healthy_threshold   = 3
+           interval            = 30
+           matcher             = "200"
+           path                = "/health"
+           port                = "traffic-port"
+           protocol            = "HTTP"
+           timeout             = 10
+           unhealthy_threshold = 3
        }

+       stickiness {
+           cookie_duration = (known after apply)
+           cookie_name     = (known after apply)
+           enabled         = (known after apply)
+           type            = (known after apply)
        }

+       target_failover {
+           on_deregistration = (known after apply)
+           on_unhealthy      = (known after apply)
        }
    }

  # module.alb.aws_route53_record.alb[0] will be created
+ resource "aws_route53_record" "alb" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "logicalis-poc.clidom.es"
+       type            = "A"
+       zone_id         = "Z3VBSH4Z3N3V93"

+       alias {
+           evaluate_target_health = false
+           name                   = (known after apply)
+           zone_id                = (known after apply)
        }
    }

  # module.alb.aws_security_group.alb will be created
+ resource "aws_security_group" "alb" {
+       arn                    = (known after apply)
+       description            = "Security group for logicalis-poc-prod ALB."
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "All traffic allowed."
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "172.31.0.0/16",
+                   "10.64.0.0/16",
                ]
+               description      = "Allow inbound traffic to ALB port 443"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "172.31.0.0/16",
+                   "10.64.0.0/16",
                ]
+               description      = "Allow inbound traffic to ALB port 80"
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
        ]
+       name                   = "logicalis-poc-prod-private-alb"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "security-group"
+           "WAF"         = "disassociated"
        }
+       tags_all               = {
+           "Application" = "logicalis-poc"
+           "Deployment"  = "terraform"
+           "Environment" = "prod"
+           "Monitored"   = "datadog"
+           "Name"        = "logicalis-poc-prod-private-alb"
+           "Owner"       = "chufis"
+           "Resource"    = "security-group"
+           "WAF"         = "disassociated"
        }
+       vpc_id                 = "vpc-f504e990"
    }

  # module.basic_dashboard[0].datadog_dashboard_json.dashboard_json will be created
+ resource "datadog_dashboard_json" "dashboard_json" {
+       dashboard               = jsonencode(
            {
+               description               = <<-EOT
                    ## logicalis-poc
                    
-                     [Github Project](https://github.com/holaluz/logicalis-poc)
-                     [Notion](https://www.notion.so/holaluz) 
                EOT
+               is_read_only              = true
+               layout_type               = "ordered"
+               notify_list               = []
+               reflow_type               = "fixed"
+               template_variable_presets = [
+                   {
+                       name               = "prod"
+                       template_variables = [
+                           {
+                               name  = "Environment"
+                               value = "prod"
                            },
+                           {
+                               name  = "DatabaseEnvironment"
+                               value = "prod"
                            },
                        ]
                    },
+                   {
+                       name               = "staging"
+                       template_variables = [
+                           {
+                               name  = "Environment"
+                               value = "staging"
                            },
+                           {
+                               name  = "DatabaseEnvironment"
+                               value = "test"
                            },
                        ]
                    },
                ]
+               template_variables        = [
+                   {
+                       default = "logicalis-poc"
+                       name    = "Application"
+                       prefix  = "application"
                    },
+                   {
+                       default = "prod"
+                       name    = "Environment"
+                       prefix  = "environment"
                    },
+                   {
+                       default = "logicalis-poc-crons"
+                       name    = "ApplicationCrons"
+                       prefix  = "application"
                    },
+                   {
+                       default = "logicalis-poc"
+                       name    = "Database"
+                       prefix  = "application"
                    },
+                   {
+                       default = "prod"
+                       name    = "DatabaseEnvironment"
+                       prefix  = "environment"
                    },
+                   {
+                       default = "logicalis-poc-prod"
+                       name    = "cluster"
+                       prefix  = "cluster_name"
                    },
                ]
+               title                     = "logicalis-poc-infra"
+               widgets                   = [
+                   {
+                       definition = {
+                           background_color = "purple"
+                           layout_type      = "ordered"
+                           show_title       = true
+                           title            = "Application Load Balancer (ALB)"
+                           type             = "group"
+                           widgets          = [
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "vertical"
+                                       markers        = []
+                                       requests       = [
+                                           {
+                                               display_type    = "bars"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "4XX"
+                                                       formula = "query1"
                                                    },
+                                                   {
+                                                       alias   = "5XX"
+                                                       formula = "query2"
                                                    },
+                                                   {
+                                                       alias   = "3XX"
+                                                       formula = "query3"
                                                    },
                                                ]
+                                               on_right_yaxis  = false
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "sum:aws.applicationelb.httpcode_target_4xx{$Environment,$Application} by {host}.as_count()"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query2"
+                                                       query       = "sum:aws.applicationelb.httpcode_target_5xx{$Environment,$Application} by {host}.as_count()"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query3"
+                                                       query       = "sum:aws.applicationelb.httpcode_target_3xx{$Environment,$Application} by {host}.as_count()"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   palette = "warm"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "HTTP 3XX, 4XX & 5XX Responses"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 2
+                                       width  = 6
+                                       x      = 0
+                                       y      = 0
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "vertical"
+                                       markers        = []
+                                       requests       = [
+                                           {
+                                               display_type    = "bars"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "2XX"
+                                                       formula = "query4"
                                                    },
                                                ]
+                                               on_right_yaxis  = false
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query4"
+                                                       query       = "sum:aws.applicationelb.httpcode_target_2xx{$Environment,$Application} by {host}.as_count()"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   palette = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "HTTP 2XX Responses"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 2
+                                       width  = 6
+                                       x      = 6
+                                       y      = 0
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "vertical"
+                                       markers        = []
+                                       requests       = [
+                                           {
+                                               display_type    = "bars"
+                                               formulas        = [
+                                                   {
+                                                       formula = "query1"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "sum:aws.applicationelb.active_connection_count{$Environment,$Application} by {host}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   palette = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Active Connections"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 2
+                                       width  = 6
+                                       x      = 0
+                                       y      = 2
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
+                                           "avg",
                                        ]
+                                       legend_layout  = "vertical"
+                                       markers        = []
+                                       requests       = [
+                                           {
+                                               display_type    = "area"
+                                               formulas        = [
+                                                   {
+                                                       formula = "query1"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:aws.applicationelb.target_response_time.average{$Environment,$Application}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Response Time"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 2
+                                       width  = 6
+                                       x      = 6
+                                       y      = 2
                                    }
                                },
                            ]
                        }
                    },
+                   {
+                       definition = {
+                           background_color = "vivid_orange"
+                           layout_type      = "ordered"
+                           show_title       = true
+                           title            = "ECS"
+                           type             = "group"
+                           widgets          = [
+                               {
+                                   definition = {
+                                       background_color = "gray"
+                                       content          = "Task status"
+                                       font_size        = "18"
+                                       show_tick        = true
+                                       text_align       = "center"
+                                       tick_edge        = "bottom"
+                                       tick_pos         = "50%"
+                                       type             = "note"
                                    }
+                                   layout     = {
+                                       height = 1
+                                       width  = 6
+                                       x      = 0
+                                       y      = 0
                                    }
                                },
+                               {
+                                   definition = {
+                                       requests    = [
+                                           {
+                                               formulas        = [
+                                                   {
+                                                       formula = "query1"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       aggregator  = "last"
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:aws.ecs.service.running{$Application,$Environment} by {servicename}"
                                                    },
+                                                   {
+                                                       aggregator  = "last"
+                                                       data_source = "metrics"
+                                                       name        = "query2"
+                                                       query       = "avg:aws.ecs.service.desired{$Application,$Environment} by {servicename}"
                                                    },
+                                                   {
+                                                       aggregator  = "last"
+                                                       data_source = "metrics"
+                                                       name        = "query3"
+                                                       query       = "avg:aws.ecs.service.pending{$Application,$Environment} by {servicename}"
                                                    },
                                                ]
+                                               response_format = "scalar"
                                            },
                                        ]
+                                       title       = "Task per Service in Cluster"
+                                       title_align = "left"
+                                       title_size  = "16"
+                                       type        = "toplist"
                                    }
+                                   layout     = {
+                                       height = 2
+                                       width  = 6
+                                       x      = 6
+                                       y      = 0
                                    }
                                },
+                               {
+                                   definition = {
+                                       autoscale   = true
+                                       precision   = 2
+                                       requests    = [
+                                           {
+                                               formulas        = [
+                                                   {
+                                                       formula = "query1"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       aggregator  = "last"
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "sum:aws.ecs.service.running{$Application,$Environment}"
                                                    },
                                                ]
+                                               response_format = "scalar"
                                            },
                                        ]
+                                       title       = "RUNNING"
+                                       title_align = "left"
+                                       title_size  = "16"
+                                       type        = "query_value"
                                    }
+                                   layout     = {
+                                       height = 1
+                                       width  = 2
+                                       x      = 0
+                                       y      = 1
                                    }
                                },
+                               {
+                                   definition = {
+                                       autoscale   = true
+                                       precision   = 2
+                                       requests    = [
+                                           {
+                                               formulas        = [
+                                                   {
+                                                       formula = "query1"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       aggregator  = "last"
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "sum:aws.ecs.service.pending{$Application,$Environment}"
                                                    },
                                                ]
+                                               response_format = "scalar"
                                            },
                                        ]
+                                       title       = "PENDING"
+                                       title_align = "left"
+                                       title_size  = "16"
+                                       type        = "query_value"
                                    }
+                                   layout     = {
+                                       height = 1
+                                       width  = 2
+                                       x      = 2
+                                       y      = 1
                                    }
                                },
+                               {
+                                   definition = {
+                                       autoscale   = true
+                                       precision   = 2
+                                       requests    = [
+                                           {
+                                               formulas        = [
+                                                   {
+                                                       formula = "query1"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       aggregator  = "last"
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "sum:aws.ecs.service.desired{$Application,$Environment}"
                                                    },
                                                ]
+                                               response_format = "scalar"
                                            },
                                        ]
+                                       title       = "DESIRED"
+                                       title_align = "left"
+                                       title_size  = "16"
+                                       type        = "query_value"
                                    }
+                                   layout     = {
+                                       height = 1
+                                       width  = 2
+                                       x      = 4
+                                       y      = 1
                                    }
                                },
+                               {
+                                   definition = {
+                                       background_color = "gray"
+                                       content          = "CPU"
+                                       font_size        = "16"
+                                       show_tick        = true
+                                       text_align       = "center"
+                                       tick_edge        = "right"
+                                       tick_pos         = "50%"
+                                       type             = "note"
+                                       vertical_align   = "center"
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 1
+                                       x      = 0
+                                       y      = 2
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "horizontal"
+                                       markers        = [
+                                           {
+                                               display_type = "error dashed"
+                                               label        = " 90% "
+                                               value        = "y = 90"
                                            },
                                        ]
+                                       requests       = [
+                                           {
+                                               display_type    = "line"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "CPU usage %"
+                                                       formula = "query1"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:ecs.fargate.cpu.percent{service:$Application.value,env:$Environment.value}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Service CPU usage %"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 5
+                                       x      = 1
+                                       y      = 2
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "horizontal"
+                                       markers        = [
+                                           {
+                                               display_type = "error dashed"
+                                               label        = " 90% "
+                                               value        = "y = 90"
                                            },
                                        ]
+                                       requests       = [
+                                           {
+                                               display_type    = "line"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "CPU usage %"
+                                                       formula = "query1"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:ecs.fargate.cpu.percent{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "CPU usage % by Task"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 6
+                                       x      = 6
+                                       y      = 2
                                    }
                                },
+                               {
+                                   definition = {
+                                       background_color = "gray"
+                                       content          = "Memory"
+                                       font_size        = "16"
+                                       show_tick        = true
+                                       text_align       = "center"
+                                       tick_edge        = "right"
+                                       tick_pos         = "50%"
+                                       type             = "note"
+                                       vertical_align   = "center"
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 1
+                                       x      = 0
+                                       y      = 5
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "horizontal"
+                                       markers        = [
+                                           {
+                                               display_type = "error dashed"
+                                               label        = " 90% "
+                                               value        = "y = 90"
                                            },
                                        ]
+                                       requests       = [
+                                           {
+                                               display_type    = "line"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "Memory %"
+                                                       formula = "query3"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query3"
+                                                       query       = "avg:aws.ecs.memory_utilization{$Application,$Environment}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Service Memory usage %"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           max = "100"
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 5
+                                       x      = 1
+                                       y      = 5
                                    }
                                },
+                               {
+                                   definition = {
+                                       legend_columns = [
+                                           "avg",
+                                           "min",
+                                           "max",
+                                           "value",
+                                           "sum",
                                        ]
+                                       legend_layout  = "horizontal"
+                                       markers        = [
+                                           {
+                                               display_type = "error dashed"
+                                               label        = " 90% "
+                                               value        = "y = 90"
                                            },
                                        ]
+                                       requests       = [
+                                           {
+                                               display_type    = "line"
+                                               formulas        = [
+                                                   {
+                                                       alias   = "Memory %"
+                                                       formula = "query1 / query2 * 100"
                                                    },
                                                ]
+                                               queries         = [
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query1"
+                                                       query       = "avg:ecs.fargate.mem.usage{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
+                                                   {
+                                                       data_source = "metrics"
+                                                       name        = "query2"
+                                                       query       = "avg:ecs.fargate.mem.hierarchical_memory_limit{service:$Application.value,env:$Environment.value} by {task_arn}"
                                                    },
                                                ]
+                                               response_format = "timeseries"
+                                               style           = {
+                                                   line_type  = "solid"
+                                                   line_width = "normal"
+                                                   palette    = "dog_classic"
                                                }
                                            },
                                        ]
+                                       show_legend    = true
+                                       time           = {}
+                                       title          = "Memory usage % by Task"
+                                       title_align    = "left"
+                                       title_size     = "16"
+                                       type           = "timeseries"
+                                       yaxis          = {
+                                           min = "0"
                                        }
                                    }
+                                   layout     = {
+                                       height = 3
+                                       width  = 6
+                                       x      = 6
+                                       y      = 5
                                    }
                                },
+                               {
+                                   definition = {
+                                       background_color = "gray"
+                                       content          = "Disk"
+                                       font_size        = "16"
+                                       show_tick        = true
+                                       text_align       = "center"
+                                       tick_edge        = "right"
+                                       tick_pos         = "50%"
+                                       type             = "note"
+                                       vertical_align   = "center"
                                    }
+                                   layout     = {
+      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.